FreeRTOS/FreeRTOS-Plus-TCP/source/portable/NetworkInterface/STM32/NetworkInterface.c
static BaseType_t prvEthConfigInit( ETH_HandleTypeDef * pxEthHandle, const NetworkInterface_t * pxInterface );
static void prvInitMACAddresses( ETH_HandleTypeDef * pxEthHandle, NetworkInterface_t * pxInterface );
static BaseType_t prvPhyStart( ETH_HandleTypeDef * pxEthHandle, NetworkInterface_t * pxInterface );

static BaseType_t prvMacUpdateConfig( ETH_HandleTypeDef * pxEthHandle );
static uint32_t prvComputeCRC32_MAC( const uint8_t * pucMAC );
static uint32_t prvComputeEthernet_MACHash( const uint8_t * pucMAC );
static void prvSetMAC_HashFilter( ETH_HandleTypeDef * pxEthHandle, const uint8_t * pucMAC );
static void prvMACAddressConfig( ETH_HandleTypeDef * pxEthHandle, uint8_t * pucAddr );

/* static BaseType_t prvAcceptPayload( ETH_HandleTypeDef * pxEthHandle, const uint8_t * const pucEthernetBuffer ); */
static BaseType_t prvAcceptPacket( const NetworkBufferDescriptor_t * const pxDescriptor, uint16_t usLength );

NetworkInterface_t * pxSTM32_FillInterfaceDescriptor( BaseType_t xEMACIndex, NetworkInterface_t * pxInterface );

/*===========================================================================*/
/*                      Static Variable Declarations                         */
/*===========================================================================*/

static ETH_HandleTypeDef xEthHandle;

static NetworkInterface_t * pxMyInterface;
static EthernetPhy_t xPhyObject;

static TaskHandle_t xEMACTaskHandle;
static SemaphoreHandle_t xTxMutex, xTxDescSem;

static volatile BaseType_t xSwitchRequired;

static eMAC_INIT_STATUS_TYPE xMacInitStatus = eMacEthInit;

/*===========================================================================*/
/*                              Phy Hooks                                    */
/*===========================================================================*/

static BaseType_t prvPhyReadReg( BaseType_t xAddress, BaseType_t xRegister, uint32_t * pulValue )
{
    BaseType_t xResult = pdTRUE;

    if( HAL_ETH_ReadPHYRegister( &xEthHandle, ( uint32_t ) xAddress, ( uint32_t ) xRegister, pulValue ) == HAL_OK )
    {
        xResult = pdFALSE;
    }

    return xResult;
}

/*---------------------------------------------------------------------------*/

static BaseType_t prvPhyWriteReg( BaseType_t xAddress, BaseType_t xRegister, uint32_t ulValue )
{
    BaseType_t xResult = pdTRUE;

    if( HAL_ETH_WritePHYRegister( &xEthHandle, ( uint32_t ) xAddress, ( uint32_t ) xRegister, ulValue ) == HAL_OK )
    {
        xResult = pdFALSE;
    }

    return xResult;
}

/*===========================================================================*/
/*                      Network Interface Access Hooks                       */
/*===========================================================================*/

static BaseType_t prvGetPhyLinkStatus( NetworkInterface_t * pxInterface )
{
    ( void ) pxInterface;

    BaseType_t xReturn = pdFALSE;

    /* const BaseType_t xEMACIndex = *( ( BaseType_t * ) pxInterface->pvArgument ); */

    if( xPhyObject.ulLinkStatusMask != 0U )
    {
        xReturn = pdTRUE;
    }

    return xReturn;
}

/*---------------------------------------------------------------------------*/

static BaseType_t prvNetworkInterfaceInitialise( NetworkInterface_t * pxInterface )
{
    BaseType_t xInitResult = pdFAIL;

    ETH_HandleTypeDef * pxEthHandle = &xEthHandle;

    switch( xMacInitStatus )
    {
        default:
            configASSERT( pdFALSE );
            break;

        case eMacEthInit:
            if( prvEthConfigInit( pxEthHandle, pxInterface ) == pdFALSE )
            {
                break;
            }

            /*
            {
                ETH_DMAConfigTypeDef xDMAConfig;
                ( void ) HAL_ETH_GetDMAConfig( pxEthHandle, &xDMAConfig );
                xDMAConfig.
                if( HAL_ETH_SetDMAConfig( pxEthHandle, &xDMAConfig ) != HAL_OK )
                {
                    break;
                }
            }
            */

            prvInitMACAddresses( pxEthHandle, pxInterface );

            xMacInitStatus = eMacPhyInit;
            /* fallthrough */

        case eMacPhyInit:
            vPhyInitialise( &xPhyObject, ( xApplicationPhyReadHook_t ) prvPhyReadReg, ( xApplicationPhyWriteHook_t ) prvPhyWriteReg );

            if( xPhyDiscover( &xPhyObject ) == 0 )
            {
                break;
            }

            xMacInitStatus = eMacPhyStart;
            /* fallthrough */

        case eMacPhyStart:
            if( prvPhyStart( pxEthHandle, pxInterface ) == pdFALSE )
            {
                break;
            }

            xMacInitStatus = eMacTaskStart;
            /* fallthrough */

        case eMacTaskStart:
            if( prvEMACTaskStart( pxEthHandle ) == pdFALSE )
            {
                break;
            }

            xMacInitStatus = eMacEthStart;
            /* fallthrough */

        case eMacEthStart:
            if( pxEthHandle->gState != HAL_ETH_STATE_STARTED )
            {
                if( HAL_ETH_Start_IT( pxEthHandle ) != HAL_OK )
                {
                    break;
                }
            }

            xMacInitStatus = eMacInitComplete;
            /* fallthrough */

        case eMacInitComplete:
            if( prvGetPhyLinkStatus( pxInterface ) == pdTRUE )
            {
                xInitResult = pdPASS;
            }
    }

    return xInitResult;
}

/*---------------------------------------------------------------------------*/

static BaseType_t prvNetworkInterfaceOutput( NetworkInterface_t * pxInterface, NetworkBufferDescriptor_t * const pxDescriptor, BaseType_t xReleaseAfterSend )
{
    BaseType_t xResult = pdFAIL;
    /* Zero-Copy Only */
    configASSERT( xReleaseAfterSend == pdTRUE );

    if( ( xMacInitStatus == eMacInitComplete ) && ( xEthHandle.gState == HAL_ETH_STATE_STARTED ) )
    {
        if( ( pxDescriptor != NULL ) && ( pxDescriptor->pucEthernetBuffer != NULL ) && ( pxDescriptor->xDataLength <= niEMAC_DATA_BUFFER_SIZE ) )
        {
            if( prvGetPhyLinkStatus( pxInterface ) != pdFAIL )
            {
                if( xSemaphoreTake( xTxDescSem, pdMS_TO_TICKS( niEMAC_DESCRIPTOR_WAIT_TIME_MS ) ) != pdFALSE )
                {
                    if( xSemaphoreTake( xTxMutex, pdMS_TO_TICKS( niEMAC_MAX_BLOCK_TIME_MS ) ) != pdFALSE )
                    {
                        static ETH_TxPacketConfig xTxConfig = {
                            .CRCPadCtrl = ETH_CRC_PAD_INSERT,
                            #if ( ipconfigIS_ENABLED( ipconfigDRIVER_INCLUDED_TX_IP_CHECKSUM ) )
                                .Attributes = ETH_TX_PACKETS_FEATURES_CRCPAD | ETH_TX_PACKETS_FEATURES_CSUM,
                                .ChecksumCtrl = ETH_CHECKSUM_IPHDR_PAYLOAD_INSERT_PHDR_CALC,
                            #else
                                .Attributes = ETH_TX_PACKETS_FEATURES_CRCPAD,
                                .ChecksumCtrl = ETH_CHECKSUM_DISABLE,
                            #endif
                        };

                        ETH_BufferTypeDef xTxBuffer = {
                            .buffer = ( uint8_t * ) pxDescriptor->pucEthernetBuffer,
                            .len = pxDescriptor->xDataLength,
                            .next = NULL
                        };

                        xTxConfig.Length = xTxBuffer.len;
                        xTxConfig.TxBuffer = &xTxBuffer;
                        xTxConfig.pData = pxDescriptor;
                        if( HAL_ETH_Transmit_IT( &xEthHandle, &xTxConfig ) == HAL_OK )
                        {
                            /* Released later in deferred task by calling HAL_ETH_ReleaseTxPacket */
                            xReleaseAfterSend = pdFALSE;
                            xResult = pdPASS;
                        }
                        else
                        {
                            ( void ) xSemaphoreGive( xTxDescSem );
                            configASSERT( ( xEthHandle.ErrorCode & HAL_ETH_ERROR_PARAM ) == 0 );
                            configASSERT( xEthHandle.gState == HAL_ETH_STATE_STARTED );
                            if( xEthHandle.ErrorCode & HAL_ETH_ERROR_BUSY )
                            {
                                FreeRTOS_debug_printf( ( "xNetworkInterfaceOutput: Tx Busy\n" ) );
                            }
                        }
                        ( void ) xSemaphoreGive( xTxMutex );
                    }
                    else
                    {
                        ( void ) xSemaphoreGive( xTxDescSem );
                        FreeRTOS_debug_printf( ( "xNetworkInterfaceOutput: Process Busy\n" ) );
                    }
                }
                else
                {
                    FreeRTOS_debug_printf( ( "xNetworkInterfaceOutput: No Descriptors Available\n" ) );
                }
            }
            else
            {
                FreeRTOS_debug_printf( ( "xNetworkInterfaceOutput: Link Down\n" ) );
            }
        }
        else
        {
            FreeRTOS_debug_printf( ( "xNetworkInterfaceOutput: Invalid Descriptor\n" ) );
        }
    }
    else
    {
        FreeRTOS_debug_printf( ( "xNetworkInterfaceOutput: Eth Not Started\n" ) );
    }

    if( ( pxDescriptor != NULL ) && ( xReleaseAfterSend == pdTRUE ) && ( xResult == pdFAIL ) )
    {
        vReleaseNetworkBufferAndDescriptor( pxDescriptor );
    }

