FreeRTOS/FreeRTOS-Plus-TCP/source/portable/NetworkInterface/STM32/NetworkInterface.c
    if( xResult == pdFAIL )
    {
        FreeRTOS_debug_printf( ( "xNetworkInterfaceOutput: Failed\n" ) );
    }

    return xResult;
}

/*===========================================================================*/
/*                              EMAC Task                                    */
/*===========================================================================*/

static BaseType_t prvNetworkInterfaceInput( ETH_HandleTypeDef * pxEthHandle )
{
    UBaseType_t uxResult = 0;
    /* if( ( xMacInitStatus == eMacInitComplete ) && ( heth->gState == HAL_ETH_STATE_STARTED ) ) */
    #if ( ipconfigIS_ENABLED( ipconfigUSE_LINKED_RX_MESSAGES ) )
        NetworkBufferDescriptor_t * pxStartDescriptor = NULL;
        NetworkBufferDescriptor_t * pxEndDescriptor = NULL;
    #endif
    NetworkBufferDescriptor_t * pxCurDescriptor = NULL;
    IPStackEvent_t xRxEvent;
    xRxEvent.eEventType = eNetworkRxEvent;

    while( HAL_ETH_ReadData( pxEthHandle, ( void ** ) &pxCurDescriptor ) == HAL_OK )
    {
        if( pxCurDescriptor == NULL )
        {
            /* Buffer was dropped, ignore packet */
            continue;
        }
        configASSERT( pxEthHandle->RxDescList.RxDataLength <= niEMAC_DATA_BUFFER_SIZE );
        ++uxResult;
        pxCurDescriptor->pxInterface = pxMyInterface;
        pxCurDescriptor->pxEndPoint = FreeRTOS_MatchingEndpoint( pxCurDescriptor->pxInterface, pxCurDescriptor->pucEthernetBuffer );
        /* TODO: check pxEndPoint exists? Check it earlier before getting buffer? */
        #if ( ipconfigIS_ENABLED( ipconfigUSE_LINKED_RX_MESSAGES ) )
            if( pxStartDescriptor == NULL )
            {
                pxStartDescriptor = pxCurDescriptor;
            }
            else if( pxEndDescriptor != NULL )
            {
                pxEndDescriptor->pxNextBuffer = pxCurDescriptor;
            }
            pxEndDescriptor = pxCurDescriptor;
        #else
            xRxEvent.pvData = ( void * ) pxCurDescriptor;
            if( xSendEventStructToIPTask( &xRxEvent, pdMS_TO_TICKS( niEMAC_MAX_BLOCK_TIME_MS ) ) != pdPASS )
            {
                iptraceETHERNET_RX_EVENT_LOST();
                FreeRTOS_debug_printf( ( "prvNetworkInterfaceInput: xSendEventStructToIPTask failed\n" ) );
                vReleaseNetworkBufferAndDescriptor( pxCurDescriptor );
            }
        #endif /* if ( ipconfigIS_ENABLED( ipconfigUSE_LINKED_RX_MESSAGES ) ) */
    }

    #if ( ipconfigIS_ENABLED( ipconfigUSE_LINKED_RX_MESSAGES ) )
        if( uxResult > 0 )
        {
            xRxEvent.pvData = ( void * ) pxStartDescriptor;
            if( xSendEventStructToIPTask( &xRxEvent, pdMS_TO_TICKS( niEMAC_MAX_BLOCK_TIME_MS ) ) != pdPASS )
            {
                iptraceETHERNET_RX_EVENT_LOST();
                FreeRTOS_debug_printf( ( "prvNetworkInterfaceInput: xSendEventStructToIPTask failed\n" ) );
                NetworkBufferDescriptor_t * pxDescriptorToClear = pxStartDescriptor;
                do {
                    NetworkBufferDescriptor_t * pxNext = pxDescriptorToClear->pxNextBuffer;
                    vReleaseNetworkBufferAndDescriptor( pxDescriptorToClear );
                    pxDescriptorToClear = pxNext;
                } while( pxDescriptorToClear != NULL );
            }
        }
    #endif /* if ( ipconfigIS_ENABLED( ipconfigUSE_LINKED_RX_MESSAGES ) ) */

    if( uxResult == 0 )
    {
        configASSERT( ( xEthHandle.ErrorCode & HAL_ETH_ERROR_PARAM ) == 0 );
        /* ( void ) xTaskNotify( xEMACTaskHandle, eMacEventErrRx, eSetBits ); */

        if( pxEthHandle->gState != HAL_ETH_STATE_STARTED )
        {
            ( void ) xTaskNotify( xEMACTaskHandle, eMacEventErrEth, eSetBits );
        }
    }

    return ( ( BaseType_t ) ( uxResult > 0 ) );
}

/*---------------------------------------------------------------------------*/

static portTASK_FUNCTION( prvEMACHandlerTask, pvParameters )
{
    ETH_HandleTypeDef * pxEthHandle = ( ETH_HandleTypeDef * ) pvParameters;
    configASSERT( pxEthHandle );

    /* iptraceEMAC_TASK_STARTING(); */

    for( ;; )
    {
        BaseType_t xResult = pdFALSE;
        uint32_t ulISREvents = 0U;

        if( xTaskNotifyWait( 0U, eMacEventAll, &ulISREvents, pdMS_TO_TICKS( niEMAC_MAX_BLOCK_TIME_MS ) ) == pdTRUE )
        {
            if( ( ulISREvents & eMacEventRx ) != 0 )
            {
                xResult = prvNetworkInterfaceInput( pxEthHandle );
            }

            if( ( ulISREvents & eMacEventTx ) != 0 )
            {
                if( xSemaphoreTake( xTxMutex, pdMS_TO_TICKS( niEMAC_MAX_BLOCK_TIME_MS ) ) != pdFALSE )
                {
                    ( void ) HAL_ETH_ReleaseTxPacket( pxEthHandle );
                    ( void ) xSemaphoreGive( xTxMutex );
                }
            }

            if( ( ulISREvents & eMacEventErrRx ) != 0 )
            {
                /*do {
                    xResult = ( prvNetworkInterfaceInput() > 0 );
                } while ( xResult != pdFALSE );
                xResult = pdTRUE;*/
            }

            if( ( ulISREvents & eMacEventErrTx ) != 0 )
            {
                if( xSemaphoreTake( xTxMutex, pdMS_TO_TICKS( niEMAC_MAX_BLOCK_TIME_MS ) ) != pdFALSE )
                {
                    ( void ) HAL_ETH_ReleaseTxPacket( pxEthHandle );
                    while( ETH_TX_DESC_CNT - uxQueueMessagesWaiting( ( QueueHandle_t ) xTxDescSem ) > pxEthHandle->TxDescList.BuffersInUse )
                    {
                        ( void ) xSemaphoreGive( xTxDescSem );
                    }
                }
            }

            if( ( ulISREvents & eMacEventErrEth ) != 0 )
            {
                configASSERT( ( xEthHandle.ErrorCode & HAL_ETH_ERROR_PARAM ) == 0 );
            }

            if( ( ulISREvents & eMacEventErrMac ) != 0 )
            {
                /* pxEthHandle->ErrorCode & HAL_ETH_ERROR_MAC */
                /* pxEthHandle->MACErrorCode */
            }

            if( ( ulISREvents & eMacEventErrDma ) != 0 )
            {
                /* pxEthHandle->ErrorCode & HAL_ETH_ERROR_DMA */
                /* pxEthHandle->DMAErrorCode */
            }
        }

        /* pxEthHandle->gState == HAL_ETH_STATE_ERROR */

        if( xPhyCheckLinkStatus( &xPhyObject, xResult ) != pdFALSE )
        {
            if( prvGetPhyLinkStatus( pxMyInterface ) != pdFALSE )
            {
                if( pxEthHandle->gState == HAL_ETH_STATE_READY )
                {
                    /* Link Was Down */
                    if( prvMacUpdateConfig( pxEthHandle ) != pdFALSE )
                    {
                        ( void ) HAL_ETH_Start_IT( pxEthHandle );
                    }
                }
            }
            else
            {
                ( void ) HAL_ETH_Stop_IT( pxEthHandle );
                #if ( ipconfigIS_ENABLED( ipconfigSUPPORT_NETWORK_DOWN_EVENT ) )
                    /* ( void ) HAL_ETH_DeInit( pxEthHandle );
                    xMacInitStatus = eMacEthInit; */
                    FreeRTOS_NetworkDown( pxMyInterface );
                #endif
            }
        }
    }
}

