FreeRTOS/FreeRTOS-Plus-TCP/source/portable/NetworkInterface/STM32/NetworkInterface.c
/*---------------------------------------------------------------------------*/

static BaseType_t prvPhyStart( ETH_HandleTypeDef * pxEthHandle, NetworkInterface_t * pxInterface )
{
    BaseType_t xResult = pdFALSE;

    if( prvGetPhyLinkStatus( pxInterface ) == pdFALSE )
    {
        const PhyProperties_t xPhyProperties = {
            #if ( ipconfigIS_ENABLED( niEMAC_AUTO_NEGOTIATION ) )
                .ucSpeed = PHY_SPEED_AUTO,
                .ucDuplex = PHY_DUPLEX_AUTO,
            #else
                .ucSpeed = ipconfigIS_ENABLED( niEMAC_USE_100MB ) ? PHY_SPEED_100 : PHY_SPEED_10,
                .ucDuplex = ipconfigIS_ENABLED( niEMAC_USE_FULL_DUPLEX ) ? PHY_DUPLEX_FULL : PHY_DUPLEX_HALF,
            #endif

            #if ( ipconfigIS_ENABLED( niEMAC_AUTO_CROSS ) )
                .ucMDI_X = PHY_MDIX_AUTO,
            #elif ( ipconfigIS_ENABLED( niEMAC_CROSSED_LINK ) )
                .ucMDI_X = PHY_MDIX_CROSSED,
            #else
                .ucMDI_X = PHY_MDIX_DIRECT,
            #endif
        };

        if( xPhyConfigure( &xPhyObject, &xPhyProperties ) == 0 )
        {
            if( prvMacUpdateConfig( pxEthHandle ) != pdFALSE )
            {
                xResult = pdTRUE;
            }
        }
    }
    else
    {
        xResult = pdTRUE;
    }

    return xResult;
}

/*===========================================================================*/
/*                             MAC Helpers                                   */
/*===========================================================================*/

static BaseType_t prvMacUpdateConfig( ETH_HandleTypeDef * pxEthHandle )
{
    BaseType_t xResult = pdFALSE;

    if( pxEthHandle->gState == HAL_ETH_STATE_STARTED )
    {
        ( void ) HAL_ETH_Stop_IT( pxEthHandle );
    }

    ETH_MACConfigTypeDef xMACConfig;
    ( void ) HAL_ETH_GetMACConfig( pxEthHandle , &xMACConfig );
    xMACConfig.ChecksumOffload = ( FunctionalState ) ipconfigIS_ENABLED( ipconfigDRIVER_INCLUDED_RX_IP_CHECKSUM );

    #if ( ipconfigIS_ENABLED( niEMAC_AUTO_NEGOTIATION ) )
        /* TODO: xPhyStartAutoNegotiation always returns 0, Should return -1 if xPhyGetMask == 0 ? */
        ( void ) xPhyStartAutoNegotiation( &xPhyObject, xPhyGetMask( &xPhyObject ) );
        xMACConfig.DuplexMode = ( xPhyObject.xPhyProperties.ucDuplex == PHY_DUPLEX_FULL ) ? ETH_FULLDUPLEX_MODE : ETH_HALFDUPLEX_MODE;
        xMACConfig.Speed = ( xPhyObject.xPhyProperties.ucSpeed == PHY_SPEED_10 ) ? ETH_SPEED_10M : ETH_SPEED_100M;
    #else
        xPhyObject.xPhyPreferences.ucSpeed = ipconfigIS_ENABLED( niEMAC_USE_100MB ) ? PHY_SPEED_100 : PHY_SPEED_10;
        xPhyObject.xPhyPreferences.ucDuplex = ipconfigIS_ENABLED( niEMAC_USE_FULL_DUPLEX ) ? PHY_DUPLEX_FULL : PHY_DUPLEX_HALF;
        /* ucMDI_X unused */
        /* TODO: xPhyFixedValue always return 0 */
        ( void ) xPhyFixedValue( &xPhyObject, xPhyGetMask( &xPhyObject ) );
        xMACConfig.DuplexMode = xPhyObject.xPhyPreferences.ucDuplex;
        xMACConfig.Speed = xPhyObject.xPhyPreferences.ucSpeed;
    #endif

    if( HAL_ETH_SetMACConfig( pxEthHandle, &xMACConfig ) == HAL_OK )
    {
        xResult = pdTRUE;
    }

    return xResult;
}

/*---------------------------------------------------------------------------*/

/* Compute the CRC32 of the given MAC address as per IEEE 802.3 CRC32 */
static uint32_t prvComputeCRC32_MAC( const uint8_t * pucMAC )
{
    uint32_t ulCRC32 = 0xFFFFFFFF;

    for( UBaseType_t i = 0; i < 6; ++i )
    {
        ulCRC32 ^= ( uint32_t ) pucMAC[ i ];

        for( UBaseType_t j = 0; j < 8; ++j )
        {
            ulCRC32 >>= 1;
            if( ulCRC32 & 1 )
            {
                /* IEEE 802.3 CRC32 polynomial - 0x04C11DB7 */
                ulCRC32 ^= __RBIT( 0x04C11DB7 );
            }
        }
    }

    ulCRC32 = ~( ulCRC32 );
    return ulCRC32;
}

/*---------------------------------------------------------------------------*/

/* Compute the hash value of a given MAC address to index the bits in the Hash Table */
static uint32_t prvComputeEthernet_MACHash( const uint8_t * pucMAC )
{
    /* Calculate the 32-bit CRC for the MAC */
    const uint32_t ulCRC32 = prvComputeCRC32_MAC( pucMAC );

    /* Perform bitwise reversal on the CRC32 */
    const uint32_t ulHash = __RBIT( ulCRC32 );

    /* Take the upper 6 bits of the above result */
    return ( ulHash >> 26 );
}

/*---------------------------------------------------------------------------*/

/* Update the Hash Table Registers with hash value of the given MAC address */
static void prvSetMAC_HashFilter( ETH_HandleTypeDef * pxEthHandle, const uint8_t * pucMAC )
{
    static uint32_t ulHashTable[ 2 ];

    const uint32_t ulHash = prvComputeEthernet_MACHash( pucMAC );

    /* Use the upper or lower Hash Table Registers
     * to set the required bit based on the ulHash */
    if( ulHash < 32 )
    {
        ulHashTable[ 0 ] = ulHash;
    }
    else
    {
        ulHashTable[ 1 ] = ulHash;
    }

    ( void ) HAL_ETH_SetHashTable( pxEthHandle, ulHashTable );
}

/*---------------------------------------------------------------------------*/

static void prvMACAddressConfig( ETH_HandleTypeDef * pxEthHandle, uint8_t * pucAddr )
{
    /* ETH_MAC_ADDRESS0 reserved for the primary MAC-address. */
    static UBaseType_t uxMACEntry = ETH_MAC_ADDRESS1;

    switch( uxMACEntry )
    {
        case ETH_MAC_ADDRESS1:
            ( void ) HAL_ETH_SetSourceMACAddrMatch( pxEthHandle, uxMACEntry, pucAddr );
            uxMACEntry = ETH_MAC_ADDRESS2;
            break;

        case ETH_MAC_ADDRESS2:
            ( void ) HAL_ETH_SetSourceMACAddrMatch( pxEthHandle, uxMACEntry, pucAddr );
            uxMACEntry = ETH_MAC_ADDRESS3;
            break;

        case ETH_MAC_ADDRESS3:
            ( void ) HAL_ETH_SetSourceMACAddrMatch( pxEthHandle, uxMACEntry, pucAddr );
            uxMACEntry = ETH_MAC_ADDRESS0;
            break;

        case ETH_MAC_ADDRESS0:
            prvSetMAC_HashFilter( pxEthHandle, pucAddr );
            break;

        default:
            break;
    }
}

/*===========================================================================*/
/*                              Rx Helpers                                   */
/*===========================================================================*/

