FreeRTOS/FreeRTOS-Plus-TCP/source/portable/NetworkInterface/STM32/NetworkInterface.c
#if 0
#if ( defined( STM32F4 ) || defined( STM32F7 ) )
    #define ETH_IP_HEADER_IPV4   ETH_DMAPTPRXDESC_IPV4PR
    #define ETH_IP_HEADER_IPV6   ETH_DMAPTPRXDESC_IPV6PR

    #define ETH_IP_PAYLOAD_UNKNOWN   0x00000000U
    #define ETH_IP_PAYLOAD_UDP       ETH_DMAPTPRXDESC_IPPT_UDP
    #define ETH_IP_PAYLOAD_TCP       ETH_DMAPTPRXDESC_IPPT_TCP
    #define ETH_IP_PAYLOAD_ICMPN     ETH_DMAPTPRXDESC_IPPT_ICMP
#endif

static BaseType_t prvAcceptPayload( ETH_HandleTypeDef * pxEthHandle, const uint8_t * const pucEthernetBuffer )
{
    BaseType_t xResult = pdFALSE;

    #if ( ipconfigIS_ENABLED( ipconfigETHERNET_DRIVER_FILTERS_PACKETS ) )
        const UBaseType_t uxPayloadType = READ_BIT( heth->RxDescList.pRxLastRxDesc, ETH_DMARXNDESCWBF_PT )
        const ProtocolPacket_t * pxProtPacket = ( const ProtocolPacket_t * ) pucEthernetBuffer;
        const IPHeader_t * pxIPHeader = &( pxProtPacket->xTCPPacket.xIPHeader );
        switch( uxPayloadType )
        {
            case ETH_IP_PAYLOAD_UNKNOWN:
            case ETH_IP_PAYLOAD_UDP:
                if( ( xPortHasUdpSocket( xUDPHeader->usDestinationPort ) )
                #if( ipconfigUSE_DNS == 1 ) * DNS is also UDP. *
                    || ( xUDPHeader->usSourcePort == FreeRTOS_ntohs( ipDNS_PORT ) )
                #endif
                #if( ipconfigUSE_LLMNR == 1 ) * LLMNR is also UDP. *
                    || ( xUDPHeader->usDestinationPort == FreeRTOS_ntohs( ipLLMNR_PORT ) )
                #endif
                #if( ipconfigUSE_NBNS == 1 ) * NBNS is also UDP. *
                    || ( xUDPHeader->usDestinationPort == FreeRTOS_ntohs( ipNBNS_PORT ) )
                #endif
                )
                {
                    xResult = pdTRUE;
                }
                else
                {
                    xResult = pdFALSE;
                }
                break;

            case ETH_IP_PAYLOAD_TCP:
            case ETH_IP_PAYLOAD_ICMPN:
            default:
        }
    #endif

    return xResult;
}
#endif

/*---------------------------------------------------------------------------*/

static BaseType_t prvAcceptPacket( const NetworkBufferDescriptor_t * const pxDescriptor, uint16_t usLength )
{
    BaseType_t xResult = pdFALSE;

    uint32_t ulErrorCode = 0;
    ( void ) HAL_ETH_GetRxDataErrorCode( &xEthHandle, &ulErrorCode );

    if ( ulErrorCode == 0 )
    {
        if( usLength <= niEMAC_DATA_BUFFER_SIZE )
        {
            /* if( prvAcceptPayload( &xEthHandle, pxDescriptor->pucEthernetBuffer ) != pdFALSE )
            {

            }
            else
            {
                FreeRTOS_debug_printf( ( "prvAcceptPacket: Payload discarded\n" ) );
            }
            */

            #if ( ipconfigIS_DISABLED( ipconfigETHERNET_DRIVER_FILTERS_FRAME_TYPES ) )
                xResult = pdTRUE;
            #else
                /* TODO: Handle this in hardware via HAL_ETH_SetMACFilterConfig */
                if( eConsiderFrameForProcessing( pxDescriptor->pucEthernetBuffer ) == eProcessBuffer )
                {
                    xResult = pdTRUE;
                }
                else
                {
                    FreeRTOS_debug_printf( ( "prvAcceptPacket: Frame discarded\n" ) );
                }
            #endif
        }
        else
        {
            FreeRTOS_debug_printf( ( "prvAcceptPacket: Packet size overflow\n" ) );
        }
    }
    else
    {
        FreeRTOS_debug_printf( ( "prvAcceptPacket: Rx Data Error\n" ) );
    }

    return xResult;
}

/*===========================================================================*/
/*                              IRQ Handlers                                 */
/*===========================================================================*/

void ETH_IRQHandler( void )
{
    traceISR_ENTER();

    xSwitchRequired = pdFALSE;
    HAL_ETH_IRQHandler( &xEthHandle );

    portYIELD_FROM_ISR( xSwitchRequired );
}

/*---------------------------------------------------------------------------*/

void HAL_ETH_ErrorCallback( ETH_HandleTypeDef * pxEthHandle )
{
    BaseType_t xHigherPriorityTaskWoken = pdFALSE;
    if( pxEthHandle->ErrorCode & HAL_ETH_ERROR_DMA )
    {
        if( pxEthHandle->DMAErrorCode )
        {
            if( pxEthHandle->gState == HAL_ETH_STATE_ERROR )
            {
                /* Fatal bus error occurred */
                /* eMacEventErrDma */
                ( void ) xTaskNotifyFromISR( xEMACTaskHandle, eMacEventErrEth, eSetBits, &xHigherPriorityTaskWoken );
            }
            else
            {
                #if defined( STM32F4 ) || defined ( STM32F7 )
                    if( pxEthHandle->DMAErrorCode & ETH_DMASR_TBUS )
                    {
                        ( void ) xTaskNotifyFromISR( xEMACTaskHandle, eMacEventErrTx, eSetBits, &xHigherPriorityTaskWoken );
                    }

                    if( pxEthHandle->DMAErrorCode & ETH_DMASR_RBUS )
                    {
                        /* ( void ) xTaskNotifyFromISR( xEMACTaskHandle, eMacEventErrRx, eSetBits, &xHigherPriorityTaskWoken ); */
                    }
                #elif defined( STM32H5 ) || defined ( STM32H7 )
                    if( pxEthHandle->DMAErrorCode & ETH_DMACSR_TBU )
                    {
                        ( void ) xTaskNotifyFromISR( xEMACTaskHandle, eMacEventErrTx, eSetBits, &xHigherPriorityTaskWoken );
                    }

                    if( pxEthHandle->DMAErrorCode & ETH_DMACSR_RBU )
                    {
                        /* ( void ) xTaskNotifyFromISR( xEMACTaskHandle, eMacEventErrRx, eSetBits, &xHigherPriorityTaskWoken ); */
                    }
                #endif
            }
        }
    }

    if( pxEthHandle->ErrorCode & HAL_ETH_ERROR_MAC )
    {
        if( pxEthHandle->MACErrorCode )
        {
            /* ( void ) xTaskNotifyFromISR( xEMACTaskHandle, eMacEventErrMac, eSetBits, &xHigherPriorityTaskWoken ); */
        }
    }

    configASSERT( ( xEthHandle.ErrorCode & HAL_ETH_ERROR_PARAM ) == 0 );

    xSwitchRequired |= xHigherPriorityTaskWoken;
}

